app/controllers/documents_controller.rb

SELECT "summaries".* FROM "summaries" WHERE ("summaries".document_id IN (30,29,28,27,26,25,24,23,22,21))
SELECT * FROM "documents" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "documents"
SELECT count(*) AS count_all FROM `summaries` WHERE (`summaries`.document_id = 23)
---
  def index
    @documents = Document.paginate(:order => "created_at DESC", :include => :summaries, :per_page => 10, :page => params[:page])

SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
---
  def show
    @document = Document.find(params[:id])

SELECT * FROM `documents` WHERE (`documents`.`id` = 21)
---
  def edit
    @document = Document.find(params[:id])

INSERT INTO `documents` (`name`, `created_at`, `body`, `updated_at`, `original_url`, `description`, `number_of_pages`) VALUES('HR3590', '2010-03-30 20:25:03', 'super-long original text', '2010-03-30 20:25:03', 'http://whitehouse.gov/signed_bills/hr3590', 'This is the health bill in its pre-amended version. This was signed by President Obama on such-and-such a date ...', 906)
---
  def create
    @document = Document.new(params[:document])

    respond_to do |format|
      if @document.save

SELECT * FROM `documents` WHERE (`documents`.`id` = 21)
UPDATE `documents` SET `updated_at` = '2010-03-30 23:54:39', `description` = '' WHERE `id` = 21
---
  def update
    @document = Document.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])

SELECT * FROM `documents` WHERE (`documents`.`id` = 11)
DELETE FROM `documents` WHERE `id` = 11
---
  def destroy
    @document = Document.find(params[:id])
    @document.destroy