app/controllers/summaries_controller.rb

SELECT * FROM "summaries"
---
  def index
    @summaries = Summary.all

SELECT * FROM `summaries` WHERE (`summaries`.document_id = 21)
---
  def show
    @summary = Summary.find(params[:id])

INSERT INTO `summaries` (`document_id`, `created_at`, `body`, `page_end`, `updated_at`, `down_votes`, `up_votes`, `page_begin`, `type_of_subset`) VALUES(21, '2010-03-30 19:39:50', 'this is a test summary on my local machine.', 12, '2010-03-30 19:39:50', NULL, NULL, 10, 'specific pages')
---
  def create
    @summary = Summary.new(params[:summary])
    @summary.user = current_user if user_signed_in?
    respond_to do |format|
      if @summary.save