app/controllers/summary_votes_controller.rb

  def index
    @summary_votes = SummaryVote.all
---
SELECT * FROM `summary_votes`

  def show
    @summary_vote = SummaryVote.find(params[:id])
---
SELECT * FROM `summary_votes` WHERE (`summary_votes`.`id` = 1)

  def create
    @summary_vote = SummaryVote.new(params[:summary_vote])

    respond_to do |format|
      if @summary_vote.save
---
INSERT INTO `summary_votes` (`summary_id`, `created_at`, `updated_at`, `score`) VALUES(NULL, '2010-03-27 23:48:21', '2010-03-27 23:48:21', 1)